In [32]:
import pandas as pd

In [33]:
data= pd.read_csv("./Dataset/User0_credit_card_transactions.csv")
data.head(10)

,User,Card,Year,Month,Day,Time,Amount,Use Chip,Merchant Name,Merchant City,Merchant State,Zip,MCC,Errors?,Is Fraud?
0,0,0,2002,9,1,06:21,$134.09,Swipe Transaction,3527213246127876953,La Verne,CA,91750.0,5300,NaN,No
1,0,0,2002,9,1,06:42,$38.48,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,NaN,No
2,0,0,2002,9,2,06:22,$120.34,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,NaN,No
3,0,0,2002,9,2,17:45,$128.95,Swipe Transaction,3414527459579106770,Monterey Park,CA,91754.0,5651,NaN,No
4,0,0,2002,9,3,06:23,$104.71,Swipe Transaction,5817218446178736267,La Verne,CA,91750.0,5912,NaN,No
5,0,0,2002,9,3,13:53,$86.19,Swipe Transaction,-7146670748125200898,Monterey Park,CA,91755.0,5970,NaN,No
6,0,0,2002,9,4,05:51,$93.84,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,NaN,No
7,0,0,2002,9,4,06:09,$123.50,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,NaN,No
8,0,0,2002,9,5,06:14,$61.72,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,NaN,No
9,0,0,2002,9,5,09:35,$57.10,Swipe Transaction,4055257078481058705,La Verne,CA,91750.0,7538,NaN,No

In [34]:
transactions=data[["Year","Month","Amount"]]
transactions.head(10)

   Year  Month   Amount
0  2002      9  $134.09
1  2002      9   $38.48
2  2002      9  $120.34
3  2002      9  $128.95
4  2002      9  $104.71
5  2002      9   $86.19
6  2002      9   $93.84
7  2002      9  $123.50
8  2002      9   $61.72
9  2002      9   $57.10

In [35]:
transactions.dtypes

Year       int64
Month      int64
Amount    object
dtype: object

In [36]:
df=pd.DataFrame(transactions)
df['Amount'] = df['Amount'].str[1:]

In [38]:
df.head

<bound method NDFrame.head of        Year  Month  Amount
0      2002      9  134.09
1      2002      9   38.48
2      2002      9  120.34
3      2002      9  128.95
4      2002      9  104.71
...     ...    ...     ...
19958  2009      2    9.71
19959  2009      2   27.94
19960  2009      2   13.97
19961  2009      3   14.27
19962  2009      3   13.55

[19963 rows x 3 columns]>

In [40]:
df.dtypes

Year       int64
Month      int64
Amount    object
dtype: object

In [42]:
df['Amount'] = pd.to_numeric(df['Amount'], errors='coerce')

In [44]:
df.dtypes

Year        int64
Month       int64
Amount    float64
dtype: object

In [50]:
year_month_sum = df.groupby(['Year', 'Month'])['Amount'].sum()
year_month_sum.head(30)

Year  Month
2002  9         7293.44
      10        6957.09
      11        7257.44
      12        6383.49
2003  1        10133.14
      2         4664.50
      3        10276.88
      4         7834.67
      5         7559.71
      6         8286.11
      7         6997.48
      8         7861.31
      9         7365.79
      10        7157.80
      11        7287.67
      12        7030.82
2004  1         7431.47
      2         6289.32
      3         6441.33
      4         9266.81
      5         8183.30
      6         7108.10
      7        10435.15
      8         7511.33
      9         7570.55
      10        6963.36
      11        8335.92
      12        9245.23
2005  1         8876.23
      2         6958.07
Name: Amount, dtype: float64

In [52]:
year_sum = df.groupby('Year')['Amount'].sum()
year_sum.head(8)

Year
2002    27891.46
2003    92455.88
2004    94781.87
2005    92019.91
2006    91881.24
2007    93494.81
2008    96205.96
2009    91329.85
Name: Amount, dtype: float64

In [54]:
year_sum.to_csv("transactions_year_sum.csv")

In [55]:
year_month_sum.to_csv("transactions_year_month_sum.csv")